In [1]:
import pandas as pd

In [3]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

QUESTION 1

In [4]:
series = pd.Series([4,8,15,16,23,42])
series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

QUESTION 2

In [6]:
l = [i for i in range(10)]
pd.Series(l)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

QUESTION 3

In [9]:
dic = {
    "name" : ["Alice","Bob","claire"],
    "age" : [25,30,27],
    'Gender' : ["female","male","female"]
}

df = pd.DataFrame(dic)
df

     name  age  Gender
0   Alice   25  female
1     Bob   30    male
2  claire   27  female

QUESTION 4

In [14]:
# Data frame is 2-D data structue that store data in tabular fashion where as Series is 1-d data structure that store labelled data
# Dataframe is mutable whereas data series is immutabe 
# data frame example
print(df)
# data series example
print("series")
print(series)

     name  age  Gender
0   Alice   25  female
1     Bob   30    male
2  claire   27  female
series
0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

QUESTION 5

In [11]:
import pandas as pd

# used to create series 
s = pd.Series([1,2,34,4,5],index=['a','b','c','d','e'])
print(s)

#used to create Dataframe
df = pd.DataFrame({
    'key1' : [1,2,2,4,4],
    'key2' : [6,7,8,9,0],
    'key3' : [1,1,0,0,1]

})
print(df)

#used to categoried the data
category = pd.Categorical(df['key3'])

#used to get the array of unique data
unique = df['key1'].unique()

#used to provide some useful insights of the data in data frame
print(df.describe())

#used to delete the rows/columns which contain NaN
#for columns axis = 1
df.dropna(inplace=True)

#used the to delete the row /columns  
df.drop(4,inplace=True)

#used to fill the NaN place with sum data
df.fillna("yash",inplace=True)

#used to concatinate two or more dataframe 
#pd.concat([dataframe1,dataframe2],axis = 1)

a     1
b     2
c    34
d     4
e     5
dtype: int64
   key1  key2  key3
0     1     6     1
1     2     7     1
2     2     8     0
3     4     9     0
4     4     0     1
           key1      key2      key3
count  5.000000  5.000000  5.000000
mean   2.600000  6.000000  0.600000
std    1.341641  3.535534  0.547723
min    1.000000  0.000000  0.000000
25%    2.000000  6.000000  0.000000
50%    2.000000  7.000000  1.000000
75%    4.000000  8.000000  1.000000
max    4.000000  9.000000  1.000000

QUESTION 6

In [ ]:
# DATAFRAME

QUESTION 7

In [21]:
ser1 = pd.Series(["yash","harsh","aniket"])
ser2 = pd.Series([20,23,24])
ser3 = pd.Series(["male","male",'male'])
frame = {
    'name' : ser1,
    'age' : ser2,
    "Gender" : ser3

}
df6 = pd.DataFrame(frame)
df6

     name  age Gender
0    yash   20   male
1   harsh   23   male
2  aniket   24   male